[
  {
    "number": "01",
    "title": "FEM Gallery",
    "lang": "React",
    "image": "banner.png",
    "slug": "fem-gallery",
    "text1": "FEM Gallery is a project, made with React to showcase all of my completed challenges from frontendmentor.io. It currently has 25 projects.",
    "text2": "I got this idea from a random person I found on frontendmentor. I took a look at his completed challenges and they're all built in one big react app. That gave me the idea to build a seperate website where I put all my completed challenges, sort of like a gallery.",
    "text3": "For the design, I tried something interesting by trying to use only two colors and it turned out better than I expected. I also tried adding different interesting layouts to make it look a bit more unique.",
    "live": "https://fem-gallery.netlify.app",
    "repo": "https://github.com/K4UNG/fem-challenge-gallery"
  },
  {
    "number": "02",
    "title": "Khanner Blog",
    "lang": "Django",
    "image": "banner.png",
    "slug": "khanner-blog",
    "text1": "Khanner Blog is a blog site I made for one of my friends, using Django. It's also the first project I collaborated with someone, another friend of mine.",
    "text2": "I was taking CS50 Web course at the time and one of the lectures was about Django. I watched another course on Django from YouTube to finish the asignment. It was more than enough just for a small project so I offered my friend a blog site.",
    "text3": "The design was very basic. It has featured posts accessible from both home and blogs page. It also has latest posts section, all blogs page with pagination, categories section and login signup forms. I kept it all fairly simple.",
    "live": "https://khanner-blog.herokuapp.com",
    "repo": ""
  },
  {
    "number": "03",
    "title": "Cooking Bud",
    "lang": "React",
    "image": "banner.png",
    "slug": "cooking-bud",
    "text1": "Cooking Bud is the ultimate cooking recipe hub for homecooks. It's built using React and Sponacular API.",
    "text2": "I randomly got an idea to build a recipe app so here it is. It has a feature where you can choose you ingredients and search for recipes with those ingredients. It also has recipe recomendations that refresh automatically twice a day.",
    "text3": "I kept the design clean and simple. It has a hero section, section with different cuisines, recommended recipes, ingredient selection page, result page and of course, recipe detail page.",
    "live": "https://cookingbud.netlify.app",
    "repo": "https://github.com/K4UNG/CookingBud"
  },
  {
    "number": "04",
    "title": "Scheduler App",
    "lang": "React",
    "image": "banner.png",
    "slug": "scheduler-app",
    "text1": "This is a scheduler app I built to help me schedule my daily studies easily.",
    "text2": "I used to always draw a clock on a piece of paper and mark different hour portions with what I want to do for that time. So I thought why not make an app out of it and here it is.",
    "text3": "I kept the design super simple. The main focus of this project was making the clock functionable. There're two clocks representing the early half(1-12AM) and another half(1-12PM) of the day respectively. There're three different modes you can switch to - Inspect lets you inspect the task details, Select lets you select a task and assign it to a part of the clock, and finally Delete lets you delete the tasks on the clock, in the tasks list or even the whole schedule.",
    "live": "https://scheduler-k4ung.netlify.app",
    "repo": "https://github.com/K4UNG/Scheduler-app"
  }
]
